emacs/.emacs.d/config.org
#+TITLE: Emacs Config
#+AUTHOR: Arya K
#+auto_tangle: t
#+PROPERTY: header-args :tangle yes
* TOC                                                                   :TOC:
- [[#ivy][IVY]]
- [[#config-reload][Config Reload]]
- [[#open-config][Open Config]]
- [[#goto-addr][GOTO-ADDR]]
- [[#expand-region][Expand Region]]
- [[#org][ORG]]
  - [[#additions][Additions]]
  - [[#ui][UI]]
  - [[#org-toc][ORG TOC]]
  - [[#org-auto-tangle][ORG Auto-Tangle]]
  - [[#org-bootstrap-html][Org Bootstrap HTML]]
- [[#which-key][Which Key]]
- [[#modeline][Modeline]]
- [[#theme][Theme]]
- [[#magit][Magit]]
- [[#goggles][Goggles]]
- [[#vterm][Vterm]]
- [[#use-local-emacs-instance-as-editor][Use local Emacs Instance as $EDITOR]]
- [[#esup][ESUP]]
- [[#scratch][Scratch]]
- [[#hungry-delete][Hungry Delete]]
- [[#org-roam][ORG Roam]]
- [[#blog][Blog]]
- [[#newline][Newline]]
- [[#general][General]]
- [[#undo-fu][Undo FU]]
- [[#autosave][AutoSave]]
- [[#emojify][Emojify]]
- [[#0x0st][0x0.st]]
- [[#discover-a-modes-keybindings][Discover a mode's keybindings]]
- [[#dired][Dired]]
- [[#telega][Telega]]
- [[#emacs-terminal-improvements][Emacs terminal improvements]]
- [[#mark-multiple][Mark Multiple]]
- [[#kill-word][Kill Word]]
- [[#copy-word][Copy Word]]
- [[#copy-line][Copy Line]]
- [[#kill-line][Kill Line]]
- [[#diminish][Diminish]]

* IVY
  I tried helm but the UI was not my taste
  I just got used to ivy
  #+begin_src emacs-lisp
    (use-package ivy
      :straight t
      :bind (("C-s" . swiper)
             :map ivy-minibuffer-map
             ("TAB" . ivy-alt-done)
             ("M-TAB" . ivy-immediate-done)
             ("C-l" . ivy-alt-done)
             ("C-j" . ivy-next-line)
             ("C-k" . ivy-previous-line)
             :map ivy-switch-buffer-map
             ("C-k" . ivy-previous-line)
             ("C-l" . ivy-done)
             ("C-d" . ivy-switch-buffer-kill)
             :map ivy-reverse-i-search-map
             ("C-k" . ivy-previous-line)
             ("C-d" . ivy-reverse-i-search-kill))
      :config
      (ivy-mode 1))
        (use-package ivy-rich :after counsel
      :straight t
      :init
      (ivy-rich-mode 1))
    (use-package counsel
      :straight t
      :bind (("M-x" . counsel-M-x)
             ("<menu>" . counsel-M-x)
             ("C-x b" . counsel-switch-buffer)
             ("C-x C-f" . counsel-find-file)
             :map minibuffer-local-map
       ("C-r" . 'counsel-minibuffer-history))
      :config
      (counsel-mode 1))

    (use-package ivy-prescient :after counsel
      :custom
      (ivy-prescient-enable-filtering nil)
      :config
      (prescient-persist-mode 1)
      (ivy-prescient-mode t))
#+end_src

* Config Reload
  I know this is a horrible shortcut for emacs
  #+begin_src emacs-lisp
(global-set-key (kbd "s-r") 'reload-config)
(defun reload-config ()
  (interactive)
  (load-file (concat user-emacs-directory "init.el")))

  #+end_src
* Open Config
  F1 is to open help in many apps
  Your Config is helpful
  #+begin_src elisp
(global-set-key (kbd "<f1>") (lambda() (interactive)(find-file "~/.emacs.d/config.org")))

  #+end_src

* GOTO-ADDR
Very useful
  #+begin_src emacs-lisp
    (use-package goto-addr :straight t
      :hook ((org-mode compilation-mode prog-mode eshell-mode shell-mode) . goto-address-mode)
      :bind (:map goto-address-highlight-keymap
	     ("<RET>" . goto-address-at-point)
	     ("M-<RET>" . newline)))
  #+end_src

* Expand Region
Very useful for selecting text
  #+begin_src emacs-lisp
(use-package expand-region
  :straight t
  :bind ("C-q" . er/expand-region)
:defer t)
  #+end_src

* ORG
** Additions
   #+begin_src emacs-lisp
               (setq org-ellipsis "▾")
               (defun ak-org-hooks ()
                 (require 'org-tempo)
                 (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
                 (add-to-list 'org-structure-template-alist '("py" . "src python"))
                 (add-to-list 'org-structure-template-alist '("sh" . "src bash"))
  (setq org-hide-emphasis-markers t)
                 (org-babel-do-load-languages
                  'org-babel-load-languages
                  '((emacs-lisp . t)
                    (python . t)))
                    (org-indent-mode 1)
                    )
          (defun up-n-fold ()
            (interactive)
             (progn
               (outline-previous-visible-heading 1)
               (org-cycle)))
               ;; (add-hook 'org-mode-hook 'ak-org-hooks)
               (use-package org
                 :straight nil
                 :bind (:map org-mode-map
     ("<C-tab>" . up-n-fold)
                        )
                 :hook (org-mode . ak-org-hooks))
     #+end_src
** UI
   #+begin_src emacs-lisp
(use-package org-bullets
:straight t
  :after org
  :hook (org-mode . org-bullets-mode))
   #+end_src

** ORG TOC
This will auto generate TOC and will update TOC on save.
#+begin_src emacs-lisp
  (use-package toc-org :defer t
:hook (org-mode . toc-org-mode)
    )
#+end_src
** ORG Auto-Tangle
It will auto tangle on save if #+autotangle is true in the file
#+begin_src emacs-lisp
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode))
#+end_src
** Org Bootstrap HTML
Export to twitter bootstrap
#+begin_src emacs-lisp
(use-package ox-twbs :defer t
  :straight t)
#+end_src
* Which Key
Key previews
  #+begin_src emacs-lisp
(use-package which-key
  :init
  (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.8
        which-key-max-description-length 25
        which-key-allow-imprecise-window-fit t
        which-key-separator " → " ))
(which-key-mode)
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  #+end_src

