emacs/.emacs.d/config.el

;; (use-package spaceline
;;   :ensure t
;;   :config
;;   (require 'spaceline-config)
;;     (setq spaceline-buffer-encoding-abbrev-p nil)
;;     (setq spaceline-line-column-p nil)
;;     (setq spaceline-line-p nil)
;;     (setq powerline-default-separator (quote arrow))
;;     (spaceline-spacemacs-theme))
;; (use-package telephone-line
;;   :after winum
;;   :custom
;;   (telephone-line-primary-left-separator 'telephone-line-cubed-left)
;;   (telephone-line-secondary-left-separator 'telephone-line-cubed-hollow-left)
;;   (telephone-line-primary-right-separator 'telephone-line-cubed-right)
;;   (telephone-line-secondary-right-separator 'telephone-line-cubed-hollow-right)
;;   (telephone-line-height 24)
;;   (telephone-line-evil-use-short-tag t)
;;   :config
;;   (telephone-line-defsegment telephone-line-pdf-segment ()
;; 			     (if (eq major-mode 'pdf-view-mode)
;; 				 (propertize (pdf-view-page-number)
;; 					     'face '(:inherit)
;; 					     'display '(raise 0.0)
;; 					     'mouse-face '(:box 1)
;; 					     'local-map (make-mode-line-mouse-map
;; 							 'mouse-1 (lambda ()
;; 								    (interactive)
;; 								    (pdf-view-goto-page))))))
;;   (telephone-line-defsegment telephone-line-winum-segment ()
;; 			     (propertize winum--mode-line-segment
;; 					 'face '(:box (:line-width 2 :color "cyan" :style released-button))
;; 					 'display '(raise 0.0)
;; 					 'mouse-face '(:box 1)))
;;   (setq telephone-line-lhs '((accent . (telephone-line-winum-segment
;; 					telephone-line-pdf-segment
;; 					telephone-line-vc-segment
;; 					telephone-line-erc-modified-channels-segment
;; 					telephone-line-process-segment))
;; 			     (nil . (telephone-line-projectile-segment telephone-line-buffer-segment))))
;;   (telephone-line-mode t))

;; (use-package telephone-line
;;   :after winum
;;   :custom
;;   (telephone-line-primary-left-separator 'telephone-line-cubed-left)
;;   (telephone-line-secondary-left-separator 'telephone-line-cubed-hollow-left)
;;   (telephone-line-primary-right-separator 'telephone-line-cubed-right)
;;   (telephone-line-secondary-right-separator 'telephone-line-cubed-hollow-right)
;;   (telephone-line-height 24)
;;   (telephone-line-evil-use-short-tag t)
;;   :config
;;   (setq telephone-line-faces '((evil . telephone-line-modal-face)
;; 			       (modal . telephone-line-modal-face)
;; 			       (ryo . telephone-line-ryo-modal-face)
;; 			       (accent telephone-line-accent-active . telephone-line-accent-inactive)
;; 			       (nil mode-line . mode-line-inactive)
;; 			       (winum . (winum-face . winum-face))))
;;   (telephone-line-defsegment telephone-line-org-clock-segment ()
;;     (when (telephone-line-selected-window-active)
;;       (if (and (functionp 'org-clocking-p) (org-clocking-p))
;; 	  (org-clock-get-clock-string))))
;;   (telephone-line-defsegment telephone-line-pdf-segment ()
;;     (when (eq major-mode 'pdf-view-mode)
;;       (propertize (pdf-view-page-number)
;; 		  'face '(:inherit)
;; 		  'display '(raise 0.0)
;; 		  'mouse-face '(:box 1))))
;;   (telephone-line-defsegment telephone-line-winum-segment ()
;;     (propertize (eval (cadr winum--mode-line-segment))
;; 		'face '(:box (:line-width 2 :color "cyan" :style released-button))
;; 		'display '(raise 0.0)
;; 		'mouse-face '(:box 1)))
;;   (telephone-line-defsegment telephone-line-battery-segment ()
;;     (when (telephone-line-selected-window-active)
;;       (propertize battery-mode-line-string
;; 		  'mouse-face '(:box 1))))

;;   (setq telephone-line-lhs '((winum . (telephone-line-winum-segment))
;; 			     (accent . (telephone-line-pdf-segment
;; 					telephone-line-vc-segment
;; 					telephone-line-erc-modified-channels-segment
;; 					telephone-line-process-segment))
;; 			     (nil . (telephone-line-projectile-segment
;; 				     telephone-line-buffer-segment
;; 				     telephone-line-org-clock-segment
;; 				     ))))
;;   (setq telephone-line-center-rhs '((evil . (telephone-line-battery-segment))))
;;   (setq telephone-line-rhs '((nil . (telephone-line-flycheck-segment
;; 				     ))
;; 			     (accent . (telephone-line-major-mode-segment))
;; 			     (evil . (telephone-line-airline-position-segment))))
;;   (telephone-line-mode t))

(use-package moody
  :unless noninteractive
  :defer 1
  ;;:init
  ;;(set-background-color "black")
  ;;(set-foreground-color "white")
  ;; If you use the default Emacs black theme (no external theme loaded) you have to specify
  ;; a different color for mode-line-buffer-id or it will be the same as the background
  ;;(set-face-attribute 'mode-line-buffer-id nil :foreground "light sky blue" :weight 'bold)
  ;;(let ((line (face-attribute 'mode-line :underline)))
  ;;  (set-face-attribute 'mode-line nil :overline line)
  ;;  (set-face-attribute 'mode-line-inactive nil :overline line)
  ;;  (set-face-attribute 'mode-line-inactive nil :underline line)
  ;;  (set-face-attribute 'mode-line nil :box nil)
  ;;  (set-face-attribute 'mode-line-inactive nil :box nil))
  :config
  (setq x-underline-at-descent-line t)
  (setq moody-mode-line-height 20)
  (moody-replace-mode-line-buffer-identification)
  (moody-replace-vc-mode))

;; (use-package doom-themes :straight t :init (load-theme 'doom-dracula))

(if (display-graphic-p)
    ;;(use-package atom-one-dark-theme :straight t :init (load-theme 'atom-one-dark))
    (use-package zerodark-theme :straight t :init (load-theme 'zerodark))
  (load-theme 'tsdh-dark))

(use-package magit :straight t :defer t :commands magit-status :custom  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package goggles
:config
(setq-default goggles-pulse t)
(goggles-mode))

(use-package vterm :straight t :defer t)
      (setq vterm-eval-cmds '(("magit-status-setup-buffer" magit-status-setup-buffer)
                          ("find-file" find-file)
                          ("message" message)
                          ("vterm-clear-scrollback" vterm-clear-scrollback)))
;; (setq  vterm-always-compile-module nil)
(use-package multi-vterm :straight t :defer t
    :bind ("s-<return>" . multi-vterm))

(use-package with-editor :defer t)

(add-hook 'vterm-exec-hook  'with-editor-export-editor)

(use-package esup :defer t)

(defun xah-new-empty-buffer ()
      "Create a new empty buffer.
    New buffer will be named “untitled” or “untitled<2>”, “untitled<3>”, etc.

    It returns the buffer (for elisp programing).

    URL `http://ergoemacs.org/emacs/emacs_new_empty_buffer.html'
    Version 2017-11-01"
      (interactive)
      (let (($buf (generate-new-buffer "untitled")))
        (switch-to-buffer $buf)
        (funcall initial-major-mode)
        (setq buffer-offer-save t)
        $buf
        ))
(defun python-scratch () (interactive) (xah-new-empty-buffer)(python-mode)(company-mode))
(defun emacs-lisp-scratch () (interactive) (xah-new-empty-buffer)(emacs-lisp-mode)(company-mode))
(defun sh-scratch () (interactive) (xah-new-empty-buffer)(sh-mode)(company-mode))
(defun c-scratch () (interactive) (xah-new-empty-buffer)(c-mode)(company-mode))
(defun sh-scratch () (interactive) (xah-new-empty-buffer)(sh-mode)(company-mode))
(defun org-scratch () (interactive) (xah-new-empty-buffer)(org-mode))

(use-package hungry-delete
  :straight t
  :config (global-hungry-delete-mode))
