emacs/.emacs.d/config.org
* ORG Roam
Note taking
  #+begin_src emacs-lisp
                     (use-package org-roam ;; Package is on melpa
                       :straight t
                   :defer t
                       :custom
                     (make-directory "~/org-roam") ;; The dir all notes are gonna be stored
                     (setq org-roam-directory (file-truename "~/org-roam"))
                     :bind (("C-c n l" . org-roam-buffer-toggle) ;; Binds
                            ("C-c n f" . org-roam-node-find)
                            ("C-c n g" . org-roam-graph) ;; Graph i was talking about.
                            ("C-c n i" . org-roam-node-insert)
                            ("C-c n c" . org-roam-capture)
                            ;; Dailies
                            ("C-c n j" . org-roam-dailies-capture-today))
                     :config
                     ;; If using org-roam-protocol
                     (require 'org-roam-protocol)
                     (add-to-list 'display-buffer-alist
                              '("\\*org-roam\\*"
                                (display-buffer-in-direction)
                                (direction . right)
                                (window-width . 0.33)
                                (window-height . fit-window-to-buffer)))
                 (setq org-roam-completion-everywhere t)
                 (org-roam-setup))
        (setq org-roam-v2-ack t)
  #+end_src

* Blog
Publish to my blog
  #+begin_src emacs-lisp
    (setq org-capture-templates
            '(("p" "Post" plain
                    (file create-blog-post)
                    (file "~/website/org-templates/post.orgcaptmpl"))))
        (defun create-blog-post ()
          "Create an org file in ~/source/myblog/posts."
          (interactive)
          (let ((name (read-string "Filename: ")))
            (expand-file-name (format "%s.org" name) "~/website/posts")))
        (defun blog-publish ()
          (interactive)
          (cd "~/website")
          (async-shell-command "make publish")
          (magit-status))
        (defun blog-post ()
          (interactive)
          "Capture a TODO item"
          (org-capture nil "p"))



  #+end_src

* Newline
As an ex-evil user this is very useful
This allows me to create a newline like vi commands o and O
  #+begin_src emacs-lisp
;; Behave like vi's o command
(defun open-next-line (arg)
  "Move to the next line and then opens a line.
 See also `newline-and-indent'."
  (interactive "p")
  (end-of-line)
  (open-line arg)
  (forward-line 1)
  (when newline-and-indent
    (indent-according-to-mode)))
(global-set-key (kbd "C-o") 'open-next-line)
;; Behave like vi's O command
(defun open-previous-line (arg)
  "Open a new line before the current one.
 See also `newline-and-indent'."
  (interactive "p")
  (beginning-of-line)
  (open-line arg)
  (when newline-and-indent
    (indent-according-to-mode)))
    (global-set-key (kbd "M-o") 'open-previous-line)
(global-set-key (kbd "C-S-o") 'open-previous-line)
;; Autoindent open-*-lines
(defvar newline-and-indent t
  "Modify the behavior of the open-*-line functions to cause them to autoindent.")
    (global-set-key [S-return]   'open-next-line)
(global-set-key [C-S-return] 'open-previous-line)

  #+end_src

* General
My keybings list
  #+begin_src emacs-lisp
(use-package general :straight t)
(global-unset-key (kbd "C-z"))
(general-define-key
 :prefix "C-z"
 "eb" 'eval-buffer
 "ed" 'eval-defun
 "ee" 'eval-expression
 "el" 'eval-last-sexp
 "er" 'eval-region
 "ld" 'xref-find-definitions
 "lr" 'xref-find-references
 "ln" 'lsp-ui-find-next-reference
 "lp" 'lsp-ui-find-prev-reference
 "ls" 'counsel-imenu
 "le" 'lsp-ui-flycheck-list
 "lS" 'lsp-ui-sideline-mode
 "lX" 'lsp-execute-code-action
 "sp" 'python-scratch
 "sl" 'emacs-lisp-scratch
 "sc" 'c-scratch
 "so" 'org-scratch
 "ss" 'sh-scratch
 "ds" 'sudo-edit
 "dd" 'counsel-find-file
 "."     '(find-file :which-key "Find file")
 "d r"   '(counsel-recentf :which-key "Recent files")
 "d s"   '(save-buffer :which-key "Save file")
 "d c"   '(copy-file :which-key "Copy file")
 "d D"   '(delete-file :which-key "Delete file")
 "d r"   '(rename-file :which-key "Rename file")
 "f S"   '(write-file :which-key "Save file as...")
 "b n" 'blog-post
 "b p" 'blog-publish
 "SPC" 'counsel-M-x)
(use-package sudo-edit :straight t :defer t) ;; Utilities for opening files with sudo

  #+end_src

* Undo FU
better Undo
  #+begin_src emacs-lisp
  (use-package undo-fu :straight t)
  (global-set-key (kbd "C-_")   'undo-fu-only-undo)
  (global-set-key (kbd "M-_") 'undo-fu-only-redo)
(use-package undo-fu-session
  :config
  (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'")))

(global-undo-fu-session-mode)

  #+end_src

* AutoSave
Auto Save my files when im away for more than a few seconds
  #+begin_src emacs-lisp
(use-package super-save
:straight t
  :diminish super-save-mode
  :config
  (super-save-mode +1)
  (setq super-save-auto-save-when-idle t))

  #+end_src

* Emojify
Display and insert emojis in emacs
  #+begin_src emacs-lisp
(use-package emojify
  :straight t
  :commands emojify-mode)

  #+end_src
* 0x0.st
0x0.st is a very nice url shortening service i use
#+begin_src emacs-lisp
(use-package 0x0 :straight t :defer t)
#+end_src
* Discover a mode's keybindings
#+begin_src emacs-lisp
(use-package discover-my-major :straight t :defer t :bind (("C-h C-m" . discover-my-major)))
#+end_src
* Dired
#+begin_src emacs-lisp
   (use-package dired
     :straight nil
  :bind (
     :map dired-mode-map
     ("h" . dired-single-buffer-up-directory)
     ("l" . dired-single-buffer)
     ("RET" . dired-single-buffer)
     ("S-RET" . dired-single-buffer)
     ("e" . dired-ediff-files)
     ))
   (setq dired-listing-switches "-agho --group-directories-first")
   (use-package dired-single :after dired)
     (setq wdired-allow-to-change-permissions t)
     (setq wdired-allow-to-redirect-links t)
     (setq wdired-use-interactive-rename nil)
   #+end_src

* Telega
#+begin_src emacs-lisp
  (use-package telega :defer t)
#+end_src

* Emacs terminal improvements
* Mark Multiple
#+begin_src emacs-lisp
  (use-package mark-multiple
    :straight t
  :defer t
    :bind ("C-c q" . 'mark-next-like-this))
#+end_src

* Kill Word
#+begin_src emacs-lisp
(defun daedreth/kill-inner-word ()
  "Kills the entire word your cursor is in. Equivalent to 'ciw' in vim."
  (interactive)
  (forward-char 1)
  (backward-word)
  (kill-word 1))
(global-set-key (kbd "C-c w k") 'daedreth/kill-inner-word)
#+end_src

* Copy Word
#+begin_src emacs-lisp
(defun daedreth/copy-whole-word ()
  (interactive)
  (save-excursion
    (forward-char 1)
    (backward-word)
    (kill-word 1)
    (yank)))
(global-set-key (kbd "C-c w c") 'daedreth/copy-whole-word)
#+end_src

* Copy Line
#+begin_src emacs-lisp
(defun daedreth/copy-whole-line ()
  "Copies a line without regard for cursor position."
  (interactive)
  (save-excursion
    (kill-new
     (buffer-substring
      (point-at-bol)
      (point-at-eol)))))
(global-set-key (kbd "C-c l c") 'daedreth/copy-whole-line)
#+end_src

* Kill Line
#+begin_src emacs-lisp
(global-set-key (kbd "C-c l k") 'kill-whole-line)
#+end_src

* Diminish
#+begin_src emacs-lisp
(use-package diminish
  :ensure t
  :init
  (diminish 'which-key-mode)
  (diminish 'linum-relative-mode)
  (diminish 'hungry-delete-mode)
  (diminish 'visual-line-mode)
  (diminish 'subword-mode)
  (diminish 'beacon-mode)
  (diminish 'irony-mode)
  (diminish 'page-break-lines-mode)
  (diminish 'auto-revert-mode)
  (diminish 'rainbow-delimiters-mode)
  (diminish 'rainbow-mode)
  (diminish 'yas-minor-mode)
  (diminish 'flycheck-mode)
  (diminish 'ivy-mode))
#+end_src
